app/controllers/card_punches_controller.rb

SELECT * FROM "card_punches"
---
  def index
    t=Time.now
    @punched_month=DateTime.new(t.year,t.month,1)
    # @punched_month=Time.now
    t("date.month_names")[8]
    @card_punches = CardPunch.all

SELECT * FROM "card_punches" WHERE ("card_punches"."id" = 1)
---
  def show
    @card_punch = CardPunch.find(params[:id])

SELECT * FROM "card_punches" WHERE ("card_punches"."id" = 1)
---
  def edit
    @card_punch = CardPunch.find(params[:id])

INSERT INTO "card_punches" ("punch_date", "comment", "created_at", "updated_at", "end_minute", "start_hour", "start_minute", "end_hour") VALUES(NULL, NULL, '2012-05-08 19:08:59', '2012-05-08 19:08:59', NULL, NULL, NULL, NULL)
---
  def create
    @card_punch = CardPunch.new(params[:card_punch])

    respond_to do |format|
      if @card_punch.save

SELECT * FROM "card_punches" WHERE ("card_punches"."id" = 1)
DELETE FROM "card_punches" WHERE "id" = 1
---
  def destroy
    @card_punch = CardPunch.find(params[:id])
    @card_punch.destroy